https://www.youtube.com/watch?v=xvpNA7bC8cs&list=PL5-da3qGB5ICCsgW1MxlZ0Hq8LL5U3u9y&index=19

# 19. How do I select multiple rows and columns from a pandas DataFrame?

#  LOC, ILOC, IX

In [1]:
import pandas as pd

In [2]:
# read a dataset of UFO reports into a DataFrame
ufo = pd.read_csv('http://bit.ly/uforeports')

In [3]:
ufo.head(3)

          City Colors Reported Shape Reported State             Time
0       Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1  Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2      Holyoke             NaN           OVAL    CO  2/15/1931 14:00

The loc method is used to select rows and columns by label. You can pass it:

    A single label
    A list of labels
    A slice of labels
    A boolean Series
    A colon (which indicates "all labels")

# # LOC filter/selecting by label == index or columns names
### use [  , ] FOR INDEX /   whats 'rows, columns' wanted?

In [4]:
# ROW, ALL columns
ufo.loc[0, :]

City                       Ithaca
Colors Reported               NaN
Shape Reported           TRIANGLE
State                          NY
Time               6/1/1930 22:00
Name: 0, dtype: object

In [5]:
# option 1 - ROW, ALL COLUMNS, accept only brachetes - rows 0 and 1 and 2, all columns

ufo.loc[[0,1,2], :]

          City Colors Reported Shape Reported State             Time
0       Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1  Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2      Holyoke             NaN           OVAL    CO  2/15/1931 14:00

In [6]:
# option 2 - rows 0 through 2 (inclusive), all columns
# this implies "all columns", but explicitly stating "all columns" is better
ufo.loc[0:2, :]

          City Colors Reported Shape Reported State             Time
0       Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1  Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2      Holyoke             NaN           OVAL    CO  2/15/1931 14:00

In [8]:
# rows 0 through 2 (inclusive), columns 'City' and 'State'
ufo.loc[0:2 , ['City','State']]

          City State
0       Ithaca    NY
1  Willingboro    NJ
2      Holyoke    CO

In [9]:
# accomplish the same thing using double brackets - but using 'loc' is preferred since it's more explicit
ufo[['City', 'State']].head(3)

          City State
0       Ithaca    NY
1  Willingboro    NJ
2      Holyoke    CO

In [12]:
# rows 0 through 2 (inclusive), column 'City'
ufo.loc[0:3 , 'City':'State'] # everything between 'City' and 'State' to all rows

          City Colors Reported Shape Reported State
0       Ithaca             NaN       TRIANGLE    NY
1  Willingboro             NaN          OTHER    NJ
2      Holyoke             NaN           OVAL    CO
3      Abilene             NaN           DISK    KS

In [14]:
# accomplish the same thing using 'head' and 'drop'
ufo.head(3).drop('Time', axis=1)

          City Colors Reported Shape Reported State
0       Ithaca             NaN       TRIANGLE    NY
1  Willingboro             NaN          OTHER    NJ
2      Holyoke             NaN           OVAL    CO

In [ ]:
ufo[ufo.City=='Oakland'] #Select everything 'Oakland' * Option1 1

In [ ]:
ufo.loc[ufo.City=='Oakland', :] #Select everything 'Oakland' * Option1 2 loc

In [16]:
# accomplish the same thing using "chained indexing" - but using 'loc' is preferred since chained indexing can cause problems
ufo[ufo.City=='Oakland'].State # Option with two operations - slower

1694     CA
2144     CA
4686     MD
7293     CA
8488     CA
8768     CA
10816    OR
10948    CA
11045    CA
12322    CA
12941    CA
16803    MD
17322    CA
Name: State, dtype: object

#  Best code

In [15]:
# rows in which the 'City' is 'Oakland', column 'State'
ufo.loc[ufo.City=='Oakland', 'State']  # Option with one operations - saver

1694     CA
2144     CA
4686     MD
7293     CA
8488     CA
8768     CA
10816    OR
10948    CA
11045    CA
12322    CA
12941    CA
16803    MD
17322    CA
Name: State, dtype: object

In [18]:
ufo.iloc[0:3 , [0, 3]] #int #option 1

          City State
0       Ithaca    NY
1  Willingboro    NJ
2      Holyoke    CO

The **iloc** method is used to select rows and columns by **integer position**. You can pass it:

A single integer position

A list of integer positions

A slice of integer positions

A colon (which indicates "all integer positions")

#  Best code

#    LOC  = inclusive of both sides
#    ILOC = delete of second number and inclusive for the first number

In [ ]:
ufo.columns

In [ ]:
list(range(0,4)) #exclude 4 == 'Time'

In [22]:
# rows in positions 0 through 2 (exclusive), columns in positions 0 through 4 (exclusive)
ufo.iloc[0:2 , 0:4]

          City Colors Reported Shape Reported State
0       Ithaca             NaN       TRIANGLE    NY
1  Willingboro             NaN          OTHER    NJ

In [19]:
# rows in positions 0 through 2 (exclusive), all columns ('iloc' is preferred since it's more explicit)
#ufo[0:2]
ufo.iloc[:2 , :]

          City Colors Reported Shape Reported State             Time
0       Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1  Willingboro             NaN          OTHER    NJ  6/30/1930 20:00

The **ix** method is used to select rows and columns by **label or integer position**, and should only be used when you need to mix label-based and integer-based selection in the same call.

In [24]:
# read a dataset of alcohol consumption into a DataFrame and set 'country' as the index
drinks = pd.read_csv('http://bit.ly/drinksbycountry', index_col='country')

In [29]:
drinks.head(3)

,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
country,,,,,
Afghanistan,0,0,0,0.0,Asia
Albania,89,132,54,4.9,Europe
Algeria,25,0,14,0.7,Africa

# IX = aloud to select either labels of rows and columns

In [30]:
# row with label 'Albania', column in position 0
drinks.ix['Albania', 0]

/home/bragatte/Downloads/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:2: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated

89

In [31]:
# row in position 1, column with label 'beer_servings'
drinks.ix[1,'beer_servings']

/home/bragatte/Downloads/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:2: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated

89

In [32]:
# rows 'Albania' through 'Andorra' (inclusive), columns in positions 0 through 2 (exclusive)
drinks.ix['Albania':'Andorra', 0:2]

/home/bragatte/Downloads/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:2: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated

         beer_servings  spirit_servings
country
Albania             89              132
Algeria             25                0
Andorra            245              138

## IX (NO recommend to use) need to know the logic of objects 
## cause integer index counts differnt from string

In [33]:
# rows 0 through 2 (inclusive), columns in positions 0 through 2 (exclusive)
ufo.ix[0:2, 0:2] # 0:2 integer - 0:2 labels

/home/bragatte/Downloads/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:2: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated

          City Colors Reported
0       Ithaca             NaN
1  Willingboro             NaN
2      Holyoke             NaN